Revit 2027 API
SizingOptions.SetNextAvailableSize(Double, ISet<MEPSize>) Method
 Sets the next available size based on the specified inner diameter.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetNextAvailableSize(
	double innerDiameter,
	ISet<MEPSize> availableSizes
)
Public Sub SetNextAvailableSize (
	innerDiameter As Double,
	availableSizes As ISet(Of MEPSize)
)
public:
void SetNextAvailableSize(
	double innerDiameter,
	ISet<MEPSize^>^ availableSizes
)
member SetNextAvailableSize :
        innerDiameter : float *
        availableSizes : ISet<MEPSize> -> unit
Parameters
innerDiameter Double
 The inner diameter threshold that the next available size must exceed.
availableSizes ISet<MEPSize>
 The sorted list of available sizes, where the smallest possible size yet larger than the specified inner diameter will be selected.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given value for innerDiameter must be positive. -or- The innerDiameter must be within the range of availableSizes.
See Also
Reference
SizingOptions Class
SetNextAvailableSize Overload
Autodesk.Revit.DB.Analysis Namespace